<a href="https://colab.research.google.com/github/dubeyshubham786/Python_libraries/blob/main/Pandas_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Updating rows and columns

In [ ]:
import pandas as pd

In [ ]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [ ]:
df = pd.DataFrame(people)

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [ ]:
# Rename the names of the columns

df.columns = ['first_name', 'last_name', 'email']

In [ ]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [ ]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [ ]:
# TO make a specify change in our dataframe we can do this by using list comprehension

df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [ ]:
# We can also replace spaces in the columns name with the underscore 
# but here it is already in underscore so it will not make any changes
# so we replace underscore to spaces

df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [ ]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [ ]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [ ]:
# Till now we have seen to change the entire columns name
# If we want to change a specific columns name then we can do it with the help of rename method by passing the dictionary

df.rename(columns={'first_name': 'first', 'last_name':'last '}, inplace=True)

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
# Now we can see how to update our data in a row
# Let's change the last name of john row to smith

df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [ ]:
# We can change the second row by passing the values 

df.loc[2] = ['John', 'Smith', 'Johnsmith@email.com']

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      Johnsmith@email.com

In [ ]:
# Now if we just want the last name and email column

df.loc[2]

first                   John
last                   Smith
email    Johnsmith@email.com
Name: 2, dtype: object

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      Johnsmith@email.com

In [ ]:
df.loc[2, 'last'] = "Doe"
df.loc[2, 'email'] = 'JohnDoe@email.com'

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe      Johnsmith@email.com

In [ ]:
# We can also use at function to change single values

df.at[2, 'last'] = 'Smith'

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [ ]:
# Now let's say if we want to change all the email address to lower case

df['email'] = df['email'].str.lower()

In [ ]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

See the four method apply, map, applymap and replace to change the values.

In [ ]:
# Apply method on series
# Let's say we want to see the lenght of our email addresses.

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [ ]:
# We can use apply method with the help of email column

def update_email(email):
  return email.upper()

In [ ]:
df['email'].apply(update_email)

# We get a series of our email addresses in uppecases

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [ ]:
# TO make the changes in our data frame

df['email'] = df['email'].apply(update_email)

In [ ]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [ ]:
# We can also use lamda function 

df['email'] = df['email'].apply(lambda x: x.lower())

In [ ]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [ ]:
# Now let's see how apply works on our dataframe
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [ ]:
df.apply(len)

# It actually apply len function to each series of the dataframe
# It saying that our first column has a len of 3 that is corey, Jane, John

first    3
last     3
email    3
dtype: int64

In [ ]:
# We can also see the lenght of the column manually 

len(df['email'])

3

In [ ]:
# We can also use the apply function on the columns becaue rows is the default 

df.apply(len, axis='columns')

# What is going here is that it says that rows 0 have 3 values that is Corey, Schafer and coreyschafer@email.com
# That is row 0 has 3 columns values

0    3
1    3
2    3
dtype: int64

In [ ]:
# We can also get the minimum values using the minimum function in pandas series 
# Here we have our values in string so we get that value which comes first in alphabetical order

df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [ ]:
# We can also use lambda function but remember that lambda will apply only on series objects

df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [ ]:
# we can apply a function for every individual in our dataframe by using applymap function

df.applymap(len)

# This function only works on dataframe it will not work on series

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [ ]:
# Now if we want all values in our dataframe to be in the lower case

df.applymap(str.lower)

# Now if we have a numrical data in our dataframe we will get an error

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [ ]:
# Now let's use the map method
# This method will only work on the series.
# map is use for substituting each values in the series with the another values

df['first'].map({'Corey': 'Chris', "Jane": 'Mary'})

# Here note that values that we have not converted is given NaN values 
# If we want to get the values of john instead of NaN values theninstead of using map we use replace method

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [ ]:
# By using replace method 

df['first'].replace({'Corey': 'Chris', "Jane": 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [ ]:
# To change the values of our dataframe

df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [ ]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

## Now let's see with the imdb dataset

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive/')

Mounted at /content/gdrive/

In [196]:
df = pd.read_csv('/content/gdrive/MyDrive/Colab Notebooks/Github/Pandas/imdb_data.csv', index_col='id')

In [197]:
df.head()

                                belongs_to_collection  ...   revenue
id                                                     ...
1   [{'id': 313576, 'name': 'Hot Tub Time Machine ...  ...  12314651
2   [{'id': 107674, 'name': 'The Princess Diaries ...  ...  95149435
3                                                 NaN  ...  13092000
4                                                 NaN  ...  16000000
5                                                 NaN  ...   3923970

[5 rows x 22 columns]

In [198]:
# Now let's say we want to rename our column poster_path to poster_image

df.rename(columns={'poster_path': 'poster_image'})

                                  belongs_to_collection  ...    revenue
id                                                       ...
1     [{'id': 313576, 'name': 'Hot Tub Time Machine ...  ...   12314651
2     [{'id': 107674, 'name': 'The Princess Diaries ...  ...   95149435
3                                                   NaN  ...   13092000
4                                                   NaN  ...   16000000
5                                                   NaN  ...    3923970
...                                                 ...  ...        ...
2996                                                NaN  ...    1596687
2997                                                NaN  ...     180590
2998                                                NaN  ...   89456761
2999                                                NaN  ...  171963386
3000                                                NaN  ...   82087155

[3000 rows x 22 columns]

In [199]:
# Apply the changes
df.rename(columns={'poster_path': 'poster_image'}, inplace=True)

In [200]:
df.head()

                                belongs_to_collection  ...   revenue
id                                                     ...
1   [{'id': 313576, 'name': 'Hot Tub Time Machine ...  ...  12314651
2   [{'id': 107674, 'name': 'The Princess Diaries ...  ...  95149435
3                                                 NaN  ...  13092000
4                                                 NaN  ...  16000000
5                                                 NaN  ...   3923970

[5 rows x 22 columns]

In [201]:
# Now let's see do we have access to poster_image columns

df['poster_image']

id
1       /tQtWuwvMf0hCc2QR2tkolwl7c3c.jpg
2       /w9Z7A0GHEhIp7etpj0vyKOeU1Wx.jpg
3       /lIv1QinFqz4dlp5U4lQ6HaiskOZ.jpg
4       /aTXRaPrWSinhcmCrcfJK17urp3F.jpg
5       /m22s7zvkVFDU9ir56PiiqIEWFdT.jpg
                      ...
2996    /j8Q7pQ27hvH54wpxJzIuQgQCdro.jpg
2997    /sS01LSy6KDrCZAhtkO18UdnWFT1.jpg
2998    /4MENR8x6mYqnZvp2hGjSaPJz64J.jpg
2999    /nIY4kvJTTnxoBR0wycrXng5MOYs.jpg
3000    /cUT6NQP5LAJpmUoStGtXmvNt4zA.jpg
Name: poster_image, Length: 3000, dtype: object

In [202]:
# Now let's see our original_language column

df['original_language']

id
1       en
2       en
3       en
4       hi
5       ko
        ..
2996    en
2997    sv
2998    en
2999    en
3000    en
Name: original_language, Length: 3000, dtype: object

In [ ]:
# Now let's make the movie with has original language as en change to english .


df['original_language'].map({'en': 'english'})

# Now remember that when we use map anything outside of 'en' will convert to NaN values

id
1       english
2       english
3       english
4           NaN
5           NaN
         ...
2996    english
2997        NaN
2998    english
2999    english
3000    english
Name: original_language, Length: 3000, dtype: object

In [203]:
# So to avoid NaN values we can use replace method instead of map method.

df['original_language'] = df['original_language'].replace({'en': 'english'})

In [204]:
df.head()

                                belongs_to_collection  ...   revenue
id                                                     ...
1   [{'id': 313576, 'name': 'Hot Tub Time Machine ...  ...  12314651
2   [{'id': 107674, 'name': 'The Princess Diaries ...  ...  95149435
3                                                 NaN  ...  13092000
4                                                 NaN  ...  16000000
5                                                 NaN  ...   3923970

[5 rows x 22 columns]

# Pandas documentation click [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html)